In [1]:
import pandas as pd

# Data Series - <class 'pandas.core.series.Series'>

In [3]:
d = [2,3,5,7,8,9]
ds = pd.Series(d)
print(ds)
print(type(ds))

0    2
1    3
2    5
3    7
4    8
5    9
dtype: int64
<class 'pandas.core.series.Series'>

In [7]:
ds = pd.Series(d,index=['a','b','c','d','e','f'], dtype="int", name="Python")
print(ds)
print(type(ds))

a    2
b    3
c    5
d    7
e    8
f    9
Name: Python, dtype: int32
<class 'pandas.core.series.Series'>

In [9]:
d1 = [2.0,3.3,5.8,7,8,9]
ds1 = pd.Series(d)
print(ds1)
print(type(ds1))

0    2.0
1    3.3
2    5.8
3    7.0
4    8.0
5    9.0
dtype: float64
<class 'pandas.core.series.Series'>

In [10]:
obj = {"Name":["Python", "Java", "C++", "C"], "Rank":[1,2,3,4]}
obj_s = pd.Series(obj)
print(obj_s)
print(type(obj_s))

Name    [Python, Java, C++, C]
Rank              [1, 2, 3, 4]
dtype: object
<class 'pandas.core.series.Series'>

In [12]:
s1 = pd.Series(12, index=[1,2,3,4,5,6,7])
s2 = pd.Series(12, index=[1,2,3,4])
s = s1+s2
print(s)
print(type(s))

1    24.0
2    24.0
3    24.0
4    24.0
5     NaN
6     NaN
7     NaN
dtype: float64
<class 'pandas.core.series.Series'>

# DataFrame - <class 'pandas.core.frame.DataFrame'>

In [15]:
data = [2,4,6,8,10,12]
df = pd.DataFrame(data)
print(df)
print(type(df))

    0
0   2
1   4
2   6
3   8
4  10
5  12
<class 'pandas.core.frame.DataFrame'>

    0
0   2
1   4
2   6
3   8
4  10
5  12

In [17]:
data = pd.DataFrame({"A":[2,3,4,5,6], "B":[1,3,5,7,8]})
data

   A  B
0  2  1
1  3  3
2  4  5
3  5  7
4  6  8

In [18]:
data["Sum"] = data["A"] + data["B"]
data

   A  B  Sum
0  2  1    3
1  3  3    6
2  4  5    9
3  5  7   12
4  6  8   14

In [20]:
data["Sub"] = data["A"] - data["B"]
data["Mul"] = data["A"] * data["B"]
data["Div - quotient with float value"] = data["A"] / data["B"]
data["Floor Div-quotient without float value"] = data["A"] // data["B"]
data["Modulus-remainder"] = data["A"] % data["B"]
data

,A,B,Sum,Sub,Mul,Div,Div - quotient with float value,Floor Div-quotient without float value,Modulus-remainder
0,2,1,3,1,2,0.500000,2.000000,2,0
1,3,3,6,0,9,1.000000,1.000000,1,0
2,4,5,9,-1,20,1.250000,0.800000,0,4
3,5,7,12,-2,35,1.400000,0.714286,0,5
4,6,8,14,-2,48,1.333333,0.750000,0,6

In [22]:
df = pd.DataFrame({"col1":[23,23,42,342,32], "col2":[32,32,234,34,2]})
df

   col1  col2
0    23    32
1    23    32
2    42   234
3   342    34
4    32     2

In [30]:
df["True/False"] = df["col1"] <= 50
df["True1/False1"] = df["col2"] <= 50
df

   col1  col2  True/False  True1/False1
0    23    32        True          True
1    23    32        True          True
2    42   234        True         False
3   342    34       False          True
4    32     2        True          True